* Summer HW
** Algebra II [100%]
*** DONE Aleks: <2021-09-09 Thu>
1. [X] Log into ALEKS
2. [X] Leave Geometry Class
3. [X] Complete Pretest
4. [X] Complete at least an 80% mastery rating on the topic
**** Counts as a project grade
**** Code: JCYLL-EHXK4
**** rdally@jcboe.org for issues
*** Link: https://drive.google.com/file/d/1e1bWj4ZUs8ZcnIBW3vRMDMqGXMOPECvA/view

** AP Chem [100%]
*** Resources
Textbook: Chemistry, The Molecular Nature of Matter and Change, 7 th ed., by Silberberg and Amateis.
Review Book: Peterson’s AP Chemistry by Brett Barker.
*** Quiz
Memorize the table of common ions, strong acids, bases, and diatomic elements. Reference documents are on Google Classroom
*** 3 Part Assignment
1. Each assignment counts as a quiz grade
2. Write all math work
3. Include Units
**** DONE AP Chem Assignment 1 <2021-07-16 Fri>
Pages 2-4
**** DONE AP Chem Assignment 2 <2021-08-06 Fri>
CLOSED: [2021-08-19 Thu 13:46]
Pages 5-8
**** DONE AP Chem Assignment 3 <2021-08-27 Fri>
Pages 8-15
*** Link: https://drive.google.com/file/d/15JhR1OkjivA5K3aASK7XAIeSh05AAdiH/view?usp=drive_web&authuser=0

** AP Sem [100%] <2021-09-09 Thu>
*** DONE Choose a theme,
*** DONE Come up with possible questions for each lens.
CLOSED: [2021-08-19 Thu 13:46]
*** DONE Find an article which supports the question you want to explore. Use the table below.
CLOSED: [2021-08-19 Thu 13:46]
*** DONE Journal 1
*** DONE Journal 2
*** Link: https://docs.google.com/document/d/1AgheICzyVXinpNIlrc68NYpcnj3ixJpsZE4_Ji8mN5M/edit

** AP CSP [100%]
*** DONE Reading <2021-09-09 Thu>
Read chapters 1-6 of the book: Blown to Bits: Your Life, Liberty, and Happiness After the Digital Explosion by Hal Abelson, Ken Ledeem and Harry Lewis.
Book is available at http://www.bitsbook.com/excerpts/.
**** Create a vocabulary list and a journal entry for each chapter.
Vocabulary list should have a minimum of 10 words with their definitions and corresponding citation using the MLA format.
**** Journal Entry
1. Write down four Ideas
2. Critical for the chapter, page number should be included
3. Complete a double entry journal explaining your opinion on those ideas, two paragraphs minimum.
*** DONE Khan Academy <2021-08-31 Tue>
CLOSED: [2021-08-07 Sat 15:35]
**** Complete the assignment On Khanacademy
**** Code: TN2B2XJS
*** Link: https://drive.google.com/file/d/1cxUppiGJmv22fipQfyjXtoKX0wrBUBG-/view?usp=drive_web&authuser=0

* Week 1
** Thursday
*** Bio
**** DONE Checkout textbook
CLOSED: [2021-09-09 Thu 17:26]
**** DONE Getting to know sheet
CLOSED: [2021-09-11 Sat 13:57]
**** DONE Notebook + folder
CLOSED: [2021-09-11 Sat 13:56]
*** Sem
**** DONE Laptop + folder
CLOSED: [2021-09-11 Sat 13:56]
*** CSP
**** DONE Laptop + folder
CLOSED: [2021-09-11 Sat 13:56]
*** Spanish
**** DONE Notebook + folder
CLOSED: [2021-09-11 Sat 13:56]
*** Algebra 2
**** DONE Notebook + graph paper in binder
CLOSED: [2021-09-11 Sat 13:57]
*** USH 2
**** DONE Notebook + folder

** Friday
*** Bio [100%]
**** DONE Bring Home and Cover textbook   <2021-09-13 Mon>
CLOSED: [2021-09-11 Sat 15:10]
**** DONE Get to know you worksheet <2021-09-10 Fri>
CLOSED: [2021-09-11 Sat 14:09]
**** DONE [[https://classroom.google.com/u/1/c/Mzg2ODE5MzE1NTE0/a/MzIwNjU4NjYyODE4/details][Safety Rules]] <2021-09-13 Mon>
CLOSED: [2021-09-12 Sun 23:03]
*** Sem [0%]
**** DONE Make questions more descriptive (summer hw) <2021-09-17 Fri>
*** Chem [50%]
**** DONE Join College Board class <2021-09-10 Fri>
CLOSED: [2021-09-11 Sat 14:09]
*** CSP [100%]
**** DONE Random Password Algorithm Draft  <2021-09-13 Mon>
CLOSED: [2021-09-11 Sat 14:09]
*** Spanish [100%]
**** DONE Tarea 1 <2021-09-13 Mon>
*** Algebra 2 [100%]
**** DONE Info sheet <2021-09-11 Fri>
CLOSED: [2021-09-11 Sat 14:09]
*** MISC
**** DONE Organize needed notebooks/textbooks/planners <2021-09-13 Mon>
CLOSED: [2021-09-13 Mon 11:41]
:LOGBOOK:
CLOCK: [2021-09-12 Sun 23:04]--[2021-09-12 Sun 23:29] =>  0:25
:END:

* Week 2
** Monday
*** Algebra [100%]
**** DONE 4-48 multiples of 4 <2021-09-14 Tues>
CLOSED: [2021-09-13 Mon 18:29]
:LOGBOOK:
[2021-09-13 Mon 18:12]--[2021-09-13 Mon 18:29] =>  0:17
:END:
*** History [100%]
**** DONE Early Interactions <2021-09-14 Tues>
:LOGBOOK:
CLOCK: [2021-09-13 Mon 19:06]--[2021-09-13 Mon 19:19] =>  0:13
:END:
*** CSP [75%]
**** DONE CODIO Part 1 (into) <2021-09-14 Tue>
CLOSED: [2021-09-13 Mon 18:29]
**** DONE CODIO Part 2 <2021-09-14 Tue>
CLOSED: [2021-09-13 Mon 18:29]
**** DONE CODIO Vocab <2021-09-17 Fri>
**** DONE Random Password Algorithm Draft <2021-09-14 Tue>
CLOSED: [2021-09-13 Mon 18:29]

** Tuesday
*** Algebra [100%]
**** DONE 1-2 Properties of Real Numbers 20-50 m5 + 59-62  <2021-09-15 Wed>
CLOSED: [2021-09-15 Wed 01:28]
*** Bio [100%]
**** DONE CH-1 Guided Notes  <2021-09-15 Wed>
CLOSED: [2021-09-15 Wed 01:28]
**** DONE Great Monarch Migration  <2021-09-16 Thu>
:LOGBOOK:
CLOCK: [2021-09-14 Tue 19:27]--[2021-09-14 Tue 19:52] =>  0:25
:END:
*** Spanish [100%]
**** DONE Tarea 2 <2021-09-15 Wed>
CLOSED: [2021-09-20 Mon 13:18]
*** History [100%]
**** DONE European Interactions <2021-09-15 Wed>
CLOSED: [2021-09-15 Wed 01:28]
*** Other
**** DONE Check Rutgers Summer Application (premed) <2021-09-19 Sun>
**** DONE Enroll in Assignments Classrooom <2021-09-14 Tue>
CLOSED: [2021-09-14 Tue 17:22]
**** DONE Check Chem Olympiad info <2021-09-14 Tue>
CLOSED: [2021-10-04 Mon 17:55]

** Wednesday
*** Bio [100%]
**** DONE Safety Scavenger hunt
DEADLINE: <2021-09-15 Wed>
*** Spanish [100%]
**** DONE Tarea 3
CLOSED: [2021-09-20 Mon 13:18] DEADLINE: <2021-09-17 Fri>
*** Algebra [100%]
**** DONE 1-3  <2021-09-15 Wed>
CLOSED: [2021-09-19 Sun 18:18]
*** History [100%]
**** DONE Louisiana Purchase
CLOSED: [2021-09-15 Wed 14:56] DEADLINE: <2021-09-15 Wed>

* Week 3
** Monday
*** Spanish [100%]
**** DONE Tarea 6,7
DEADLINE: <2021-09-21 Tue>
*** Algebra [100%]
**** DONE 1-4  pt1
DEADLINE: <2021-09-20 Mon>
**** DONE 1-4  pt2
DEADLINE: <2021-09-21 Tue>
**** DONE ALEKS Progress Test
DEADLINE: <2021-09-23 Thu>
*** History [100%]
**** DONE Manifest Destiny
DEADLINE: <2021-09-15 Wed>

** Friday
*** Spanish [100%]
**** DONE Tarea 10
DEADLINE: <2021-09-27 Mon>
*** History [100%]
**** DONE Manifest Destiny (survival game)
CLOSED: [2021-10-02 Sat 23:14] DEADLINE: <2021-09-28 Tue>
*** Biology [100%]
**** DONE Scientific Method Practice
CLOSED: [2021-10-02 Sat 23:15] DEADLINE: <2021-09-28 Tue>
**** DONE Graphing Skills
CLOSED: [2021-10-02 Sat 23:15] DEADLINE: <2021-09-28 Tue>
*** CSP [100%]
**** DONE CODIO Practice
DEADLINE: <2021-09-28 Tue>

* Week 4
** Monday
*** Algebra [100%]
**** DONE Test study
CLOSED: [2021-10-02 Sat 23:15] DEADLINE: <2021-09-28 Tue>
*** History [100%]
**** DONE Texas
CLOSED: [2021-10-02 Sat 23:15] DEADLINE: <2021-09-28 Tue>
*** Bio [100%]
**** DONE Graphing
CLOSED: [2021-10-02 Sat 23:15] DEADLINE: <2021-09-28 Tue>
*** Chem [100%]
**** DONE Notes on Lab Safety
CLOSED: [2021-10-02 Sat 23:15] DEADLINE: <2021-09-28 Tue>
**** DONE Notes
CLOSED: [2021-10-02 Sat 23:15] DEADLINE: <2021-09-28 Tue>

** Weekend
DEADLINE: <2021-10-04 Mon>
*** Algebra [100%]
**** DONE 2.2 Linear Functions
CLOSED: [2021-10-03 Sun 18:24]
*** History [100%]
**** DONE Manifest Destiny Project
CLOSED: [2021-10-20 Wed 11:45]
**** DONE Study for history test
CLOSED: [2021-10-03 Sun 23:33]
*** Spanish [100%]
**** DONE Tarea 12,13
CLOSED: [2021-10-04 Mon 13:28]
**** DONE Vocab Study
CLOSED: [2021-10-03 Sun 23:33]
*** Chem [100%]
**** DONE Watch videos (1.1.1, 1.1.2) and take notes
CLOSED: [2021-10-04 Mon 17:54]
**** DONE Honors Chem Study
CLOSED: [2021-10-03 Sun 23:33]
*** CSP [100%]
**** DONE Project workday 1234
CLOSED: [2021-10-02 Sat 23:35]
**** DONE 1.8 Decidability and Performance
CLOSED: [2021-10-04 Mon 17:56]
**** DONE 1.9 Heuristics
CLOSED: [2021-10-03 Sun 17:56]
**** DONE AP Classroom Test
CLOSED: [2021-10-03 Sun 18:20]
*** Other
**** DONE Setup Robotics Programs
CLOSED: [2021-10-03 Sun 23:33]
**** STRT Register for Chem Olympiad
**** DONE Finish Practice PSAT Test
CLOSED: [2021-10-03 Sun 23:33]
**** DONE Finish Aeronautics Club Stuff
CLOSED: [2021-12-09 Thu 14:33]
**** DONE Finalize Student Council Speech/Presentation
CLOSED: [2021-10-04 Mon 13:27]

* Week 5
** Monday
*** Algebra [100%]
**** DONE Quiz study
CLOSED: [2021-10-05 Tue 14:35]
**** DONE 2.2 Linear Functions
CLOSED: [2021-10-05 Tue 14:35]
*** History [100%]
**** DONE Test Study
CLOSED: [2021-10-05 Tue 14:35]
*** Bio [100%]
**** DONE Test Study
CLOSED: [2021-10-05 Tue 14:35]
*** Chem [100%]
**** DONE Quiz study
CLOSED: [2021-10-05 Tue 14:35]
**** DONE Attempt 1.2.1 notes
CLOSED: [2021-10-21 Thu 00:40]
**** DONE Watch videos (1.1.1, 1.1.2) and take notes
CLOSED: [2021-10-04 Mon 17:54]
**** DONE Quiz
CLOSED: [2021-10-04 Mon 17:57]
*** CSP [100%]
**** DONE Quiz study
CLOSED: [2021-10-05 Tue 14:35]
**** DONE Group Work
CLOSED: [2021-10-04 Mon 17:52]
**** DONE 1.8 Decidability and Performance
CLOSED: [2021-10-05 Tue 14:35]
*** Other
**** DONE Finish Up Robotics Emails
CLOSED: [2021-10-05 Tue 14:35]
**** DONE PSAT Practice Test
CLOSED: [2021-10-13 Wed 22:37]
** Tuesday
*** Algebra [100%]
**** DONE Aleks Topic Goals
CLOSED: [2021-10-13 Wed 22:37] DEADLINE: <2021-10-07 Thu>
**** DONE 2.3 Slope and Rate of Change
CLOSED: [2021-10-13 Wed 22:37] DEADLINE: <2021-10-07 Thu>
*** Spanish [100%]
**** DONE Tarea 14
CLOSED: [2021-10-13 Wed 22:37] DEADLINE: <2021-10-07 Thu>
*** Seminar [100%]
**** DONE Group Topic Ideas
CLOSED: [2021-10-13 Wed 22:37] DEADLINE: <2021-10-07 Thu>
*** Bio [100%]
**** DONE Chapter 1 Guided Notes
CLOSED: [2021-10-13 Wed 22:37] DEADLINE: <2021-10-07 Thu>
**** DONE Chapter 2 Guided Notes
CLOSED: [2021-10-13 Wed 22:37] DEADLINE: <2021-10-07 Thu>
*** Chem [100%]
**** DONE Ask Mr. Black about Lockdown Browser
CLOSED: [2021-10-20 Wed 11:44]
*** CSP [100%]
**** DONE Algorithmic Bias (1.10)
CLOSED: [2021-10-13 Wed 22:37] DEADLINE: <2021-10-08 Fri>
*** Other
**** DONE Speak with Mr. Dally about Esports
CLOSED: [2021-10-05 Tue 14:42]

* Week 6
** Thursday
*** Algebra [100%]
**** DONE Aleks Topic Goals <2021-10-14 Thu>
CLOSED: [2021-10-14 Thu 01:39]
**** DONE Some BS homework <2021-10-14 Thu>
CLOSED: [2021-10-14 Thu 10:39]
**** DONE 2.6 Piecewise hw <2021-10-14 Fri>
CLOSED: [2021-10-20 Wed 11:44]
**** DONE 2.6 Piecewise notes <2021-10-14 Fri>
CLOSED: [2021-10-20 Wed 11:44]
*** Spanish [100%]
**** DONE Tarea 17 or smtg
CLOSED: [2021-10-20 Wed 11:44]
*** Chem [100%]
**** DONE MyAP Quiz
CLOSED: [2021-10-14 Thu 13:25]
**** DONE Chapter 1 notes
CLOSED: [2021-10-20 Wed 11:44]
**** DONE Practice Problems
CLOSED: [2021-10-21 Thu 01:10]
*** CSP [100%]
**** DONE Test Review <2021-10-14 Thu>
CLOSED: [2021-10-14 Thu 00:58]
**** DONE Pick Partner <2021-10-14 Thu>
CLOSED: [2021-10-14 Thu 00:59]
**** DONE Test <2021-10-14 Thu>
CLOSED: [2021-10-14 Thu 14:50]
**** DONE Grade Previous Partner  and Column Chart <2021-10-14 Thu>
CLOSED: [2021-10-20 Wed 11:44]
* Week 7
** Thursday
*** Algebra [100%]
**** DONE Aleks Topic Goals
CLOSED: [2021-10-22 Fri 03:51]
**** DONE 2.7 Tranformations hw
CLOSED: [2021-10-21 Thu 00:56]
**** DONE 2.8 Graphing Inequalities hw
CLOSED: [2021-10-21 Thu 01:18]
**** DONE 2.4-6 Quiz
*** Spanish [100%]
**** DONE Tarea 18
CLOSED: [2021-10-21 Thu 00:32]
**** DONE Tarea 19
CLOSED: [2021-10-29 Fri 14:09]
**** DONE Tarea 20
CLOSED: [2021-10-29 Fri 14:09]
*** Biology [66%]
**** DONE Organic Molecules Notes
CLOSED: [2021-10-29 Fri 14:09]
**** DONE Ocean Acidification
CLOSED: [2021-10-29 Fri 14:09]
**** DONE Question Review
CLOSED: [2021-10-29 Fri 14:10]
*** Chem [100%]
**** DONE Chapter 1-2 Textbook notes
CLOSED: [2021-10-29 Fri 14:10]
*** CSP [100%]
**** DONE Pair Programming
CLOSED: [2021-10-29 Fri 14:10]
**** DONE Welcome to Scratch
CLOSED: [2021-10-21 Thu 00:32]
*** Other [100%]
**** DONE Robotics Meeting
**** DONE Esports Matches
**** DONE Gym Participation
* Week 8
** Friday
*** Algebra [100%]
**** DONE Aleks Topic Goals
CLOSED: [2021-11-05 Fri 16:51]
*** Spanish [100%]
**** DONE Tarea 20
*** Biology [66%]
**** DONE Ocean Acidification
*** Seminar [100%]
**** DONE Video and Notes
CLOSED: [2021-11-05 Fri 16:51]
*** Chem [100%]
**** DONE Chapter 2 Daily Vid notes
CLOSED: [2021-11-05 Fri 16:51]
*** CSP [100%]
**** DONE Welcome to Scratch
CLOSED: [2021-10-21 Thu 00:32]
*** Other [100%]
**** DONE Robotics Meeting
CLOSED: [2021-11-05 Fri 16:51]

* Break
** Algebra [0%]
*** HOLD aleks topic goals
** Biology [100%]
*** DONE biology project (organic molecules)
CLOSED: [2021-12-09 Thu 14:32]
*** DONE pg 40-44 in textbook
CLOSED: [2021-12-09 Thu 14:32]
*** DONE organic molecules lab
CLOSED: [2021-12-09 Thu 14:32]
*** DONE ph lab
CLOSED: [2021-12-09 Thu 14:32]
** Seminar [100%]
*** DONE video and notes
CLOSED: [2021-12-09 Thu 14:32]
*** DONE create a question
CLOSED: [2021-12-09 Thu 14:33]
** Chem [100%]
*** DONE chapter 2 daily vid notes
CLOSED: [2021-12-09 Thu 14:33]
*** DONE myap work
CLOSED: [2021-12-09 Thu 14:33]
** Csp [100%]
*** DONE everything
CLOSED: [2021-12-09 Thu 14:33]

* 2 weeks before winter break (idk its been so long)
** Algebra [0%]
*** TODO Aleks Topic Goals
Work on Aleks topic goals throughout the week
DEADLINE: <2021-12-16 Thu>
*** TODO 4.5 PT. 2 more squaring
38 - 52 even:[[https://docs.google.com/presentation/d/1R72gToxEqTzNP_fffuOCAB9ZnFBCjiVGNNgkbLKYrIQ/edit#slide=id.p1][ slides]]
DEADLINE: <2021-12-10 Fri>
** Spanish [0%]
*** TODO Tarea 14 & 15
DEADLINE: <2021-12-10 Fri>
** Seminar [0%]
*** TODO Finish IRR1
DEADLINE: <2021-12-10 Fri>
*** TODO Start working on presentation
DEADLINE: <2021-12-13 Mon>
** Chem [0%]
*** TODO Chapter 4 daily vid notes
DEADLINE: <2021-12-16 Thu>
*** TODO MYAP Progress Checks
        * Note: Assigned throughout the week, keep track of it
             DEADLINE: <2021-12-16 Thu>
** Csp [0%]
*** TODO 3.8 Big Picture
[[https://apollo.codio.com/classroom/assignment/b18e7c44-b49a-436a-9c8c-fb5b4e421dcd][Link To Assignment]]
              DEADLINE: <2021-12-13 Mon>
*** TODO 3.9 Lists
[[https://apollo.codio.com/classroom/assignment/87e003a0-2f0f-4abb-a22d-8d3a46b30dab][Link To Assignment]]
              DEADLINE: <2021-12-14 Tue>
*** TODO 3.10 Processing Lists
[[https://apollo.codio.com/classroom/assignment/cb8c50ac-cf98-44c2-ad5b-6880296eda1b][Link To Assignment]]
              DEADLINE: <2021-12-15 Wed>
